public class Draft_Task1_3_3_4 {
    public static void main(String[] args) {
        System.out.println("Задание: \n4. Зачем нужна область видимости переменной? Было бы удобно, если б " +
                "\nпеременная, объявленная хоть где, была доступна в любом другом месте?\n\nРешение: ");
        System.out.println("Область видимости переменных нужна как раз для того, чтобы в java " +
                "\nвыполнялось т.н. объектное ориентирование, т.е. чтобы для решения, так сказать, " +
                "\nбольшой  \"абстрактной\" задачи, можно было разбить программу на \"дискретные\"  " +
                "\nкуски кода (классы, методы, циклы, ветки и т.д.) и обрабатывать отдельно " +
                "\nданный фрагмент программы, уменьшая риск запутаться в большой \"абстрактной\" " +
                "\nпрограмме.");
    }
}